#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>


/*  --------------------------  数据的类型 --------------------------  */

//1.整型
//  char
//		unsigned char
//		signed char
//  short
//		unsigned short
//		signed short
//  int
//		unsigned int
//		signed int
//  long
//		unsigned long
//		signed long
// 
//2.浮点型
//  float
//  double
// 
//3.构造类型-自定义类型
//  数组
//	struct 结构体
//  enum 枚举
//  union 联合
//  
//4.指针类型
//  char* pc
//  int* pi
//  float* pf
//	void* pv
// 
//5.空类型 void 
//  函数返回类型 void test();
//  函数参数 void test(void);
//  指针 void* p;


//int main()
//{
//	int arr[10];//int [10] 数组类型
//	int arr2[5];//int [5]
//	return 0;
//}


/*  -------------------------------        整型的存储        -----------------------------  */


/*  --------------------------  整型的原码、反码、补码 --------------------------  */

//数据在内存中以2进制的形式存储
//对于整数来说：
//整数二进制有3种表示形式:原码、反码、补码
//正整数：原码、反码、补码相同
//负整数：原码、反码、补码要进行计算的
//按照数据的数值直接写出的二进制序列就是原码
//原码的符号位不变，其他位按位取反，得到的就是反码
//反码+1，得到的就是补码
//
//整数在内存中存储的是补码


//int main()
//{
//	int a = -10;
//	int b = 10;
//	//00000000000000000000000000001010  b=10
//	//0000000a
//	//
//	//10000000000000000000000000001010-原码  a=-10
//	//11111111111111111111111111110101-反码
//	//11111111111111111111111111110110-补码
//	//FFFFFFF6
//
//	return 0;
//}


/*  --------------------------  大端字节序和小端字节序 --------------------------  */
//大端字节序
//把数据的低位字节的内容存放在高地址处，高位字节的内容存放在低地址处。
//小端字节序
//把数据的低位字节的内容存放在低地址处，高位字节的内容存放在高地址处。


//int main()
//{
//	int a = 10;
//	//00000000000000000000000000001010
//	//0a 00 00 00                     查看内存，展示形式(十六进制) -小端字节序
//
//	return 0;
//}


//判断当前机器的字节序
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//
//	return *p;//返回1表示小端，返回0表示大端
//
//}
//
// 
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");//本机是小端字节序
//	}
//	else
//	{
//		printf("大端\n");
//	}
//
//	return 0;
//}


//练习1.输出什么？
//int main()
//{
//    char a = -1;
//    //10000000000000000000000000000001
//    //11111111111111111111111111111110
//    //11111111111111111111111111111111
//    //11111111                         - 整数存到char类型内存中，发生截断
//    //11111111111111111111111111111111 - 整型提升，有符号位，补符号位1
//    signed char b = -1;
//    //11111111
//
//    unsigned char c = -1;
//    //11111111
//    //00000000000000000000000011111111 - 整型提升，无符号位，补0
//    
//    printf("a=%d,b=%d,c=%d", a, b, c);
//    //-1 -1 255
//
//    return 0;
//}


//补充：
//1. char 到底是signed char 还是unsigned char ?
//C语言标准并没有规定，取决于编译器
//
//int 是 signed int 
//short 是 signed short
//


//练习2.
//int main()
//{
//    char a = -128;
//    //10000000000000000000000010000000
//    //11111111111111111111111101111111
//    //11111111111111111111111110000000  - 补码
//    //10000000
//    //11111111111111111111111110000000  - 整型提升   %u 认为内存中的补码无符号位，补码和原码相同  4294967168
//
//    printf("%u\n", a); //4294967168
//    printf("%d\n", a); //-128
//    //11111111111111111111111110000000  - 整型提升   %d 认为内存中的补码有符号位，计算成原码打印
//    //11111111111111111111111101111111 -反码
//    //10000000000000000000000010000000 -原码  -128
//
//    return 0;
//}


//练习3.
//int main()
//{
//	char a = 128;
//	//00000000000000000000000010000000 -原码、反码、补码相同
//	//10000000
//	//11111111111111111111111110000000
//
//	printf("%u\n", a);//4294967168
//
//	return 0;
//}

//有符号的char的取值范围：-128 -- 127


//练习4.
//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100 -原码
//	//11111111111111111111111111101011 -反码
//	//11111111111111111111111111101100 -补码
// 
//	unsigned int j = 10;
//	//00000000000000000000000000001010
// 
//	printf("%d\n", i + j);//-10
//	//11111111111111111111111111101100 -i
//	//00000000000000000000000000001010 -j
//	//11111111111111111111111111110110 -i+j补码  %d 认为内存中的补码有符号位，计算成原码打印
//	//11111111111111111111111111110101 -i+j反码
//	//10000000000000000000000000001010 -i+j原码  -10
//
//	return 0;
//}


//练习5.
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);//死循环，因为无符号 i恒>=0
//	}
//
//	return 0;
//}


//练习6.
//int main()
//{
//    char a[1000];
//    int i;
//    for (i = 0; i < 1000; i++)
//    {
//        a[i] = -1 - i;
//    }
//    //128+127 = 255
//    //-1 -2 -3 ... -127 -128 127 126 125 .. 3 2 1 0 -1 -2 .. -127 -128 127 ...
//    printf("%d\n", strlen(a));//找到\0 -> 0
//
//    return 0;
//}


//有符号的char的取值范围：-128 -- 127

//int main()
//{
//	char ch1 = -129;
//	char ch2 = 128;
//
//	printf("%d\n", ch1);//127
//	printf("%d\n", ch2);//-128
//
//	return 0;
//}


//练习7.
//unsigned char i = 0;
// 
//int main()
//{
//    for (i = 0; i <= 255; i++)
//    {
//        printf("hello world\n");//死循环
//    }
//
//    return 0;
//}

////无符号的char的取值范围：0 -- 255


//#include <limits.h>
//
//int main()
//{
//	INT_MAX;
//	return 0;
//}


/*  -------------------------------        浮点型的存储        -----------------------------  */


//int main()
//{
//	float f = 5.5f;
//	//101.1
//	//1.011 * 2^2
//	//s=0 M=1.011 E=2
//	//s=0 M=011 E=2+127
//	// 	   
//	//0 10000001 011 0000 0000 0000 0000 0000
//	//40 b0 00 00
//
//	return 0;
//}


int main()
{
	int n = 9;
	//00000000000000000000000000001001      int视角存入
	
	//0 00000000 00000000000000000001001    float视角取出
	//S    E          M
	// (-1)^S * M * 2^E
	//(-1)^0 * 0.00000000000000000001001 * 2^(1-127)   E全为0的特殊情况

	float* pFloat = (float*)&n;
	printf("n的值为：%d\n", n);//int视角取出
	printf("*pFloat的值为：%f\n", *pFloat); //float视角取出

	*pFloat = 9.0;
	//1001.0
	//1.001 * 2^3
	//S=0   M=1.001    E=3   
	//S=0   M=001      E=3+127   
	//0 10000010 00100000000000000000000  float视角存入

	printf("num的值为：%d\n", n);
	printf("*pFloat的值为：%f\n", *pFloat);

	return 0;
}

