#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>


/*   --------------------     算数操作符: + - * / %    ---------------------   */

//int main()
//{
//	//int a = 6 / 5;
//	//printf("%d\n", a);//1
//
//	//float a = 6 / 5;
//	//printf("%f\n", a);//1.000000
//
//	//float a = 6.0 / 5;
//	//printf("%f\n", a);//1.200000    会有warning，6.0 默认是double类型
//
//	//double a = 6.0 / 5;
//	//double a = 6.0 / 5.0;
//	//printf("%lf\n", a);//1.200000
//
//	//int b = 7 % 3;    // %的两个操作数必须为整数
//	//printf("%d\n", b);//1
//
//	return 0;
//}


/*   --------------------     移位操作符: <<   >>    ---------------------   */

//int main()
//{
//	int a = 2;
//	//把a的二进制位向左移动一位
//	int b = a << 1;
//  //左移操作符:左边丢弃，右边补0
//	printf("b = %d\n", b);//b=4
//
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	//把a的二进制位向右移动一位
//	int b = a >> 1;
//	printf("a = %d\n", a);//a=10
//	printf("b = %d\n", b);//b=5
//
//	return 0;
//}


//int main()
//{
//	int a = -1;
//	//把a的二进制位向右移动一位
//	int b = a >> 1;
//	//当前的右移操作符使用的：算术右移(右边丢弃，左边补原符号位)
//	printf("b = %d\n", b);//b=-1
//
//	return 0;
//}


/*   --------------------     位操作符: & | ^    ---------------------   */
//操作数必须是整数

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//int c = a & b;// & - 按(二进制)位与
//	//printf("c = %d", c);//c=1
//	//00000000000000000000000000000011  a
//	//00000000000000000000000000000101  b
//	//00000000000000000000000000000001  c
//
//	//int d = a | b;// | - 按(二进制)位或
//	//printf("d = %d", d);//d=7
//	//00000000000000000000000000000011  a
//	//00000000000000000000000000000101  b
//	//00000000000000000000000000000111  d
//
//	//int e = a ^ b;// ^ - 按(二进制)位或，规则：相同为0，相异为1
//	//printf("e = %d", e);//e=6
//	//00000000000000000000000000000011  a
//	//00000000000000000000000000000101  b
//	//00000000000000000000000000000110  e
//
//	return 0;
//}


//按位异或应用场景：不创建第三个变量，实现两个数的交换
//int main()
//{
//	//a ^ a = 0;
//	//0 ^ a = a;
//
//	int a = 3;
//	int b = 5;
//	printf("a=%d b=%d\n", a, b);
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a=%d b=%d\n", a, b);
//
//	return 0;
//}


/*   --------------------     赋值操作符: = += -= *= /= %= <<= >>= &= |= ^=     ---------------------   */

//int main()
//{
//	int a = 10;
//	//a = a + 5;
//	a += 5;
//	printf("%d\n", a);
//
//	return 0;
//}


/*   --------------------     单目操作符: ! - + & sizeof ~ -- ++ * (type)    ---------------------   */

//int main()
//{
//	//int a = 10;
//	//printf("%d\n", sizeof(a));//4  计算a所占内存空间的大小，单位是字节
//	//printf("%d\n", sizeof(int));//4
//	//printf("%d\n", sizeof a);//4   证明sizeof是操作符，不是函数
//
//	//int arr1[10] = { 0 };
//	//printf("%d\n", sizeof(arr1));//40
//	//printf("%d\n", sizeof(int [10]));//40   int [10]是arr1数组的类型
//	
//	//char arr2[20] = { 0 };
//	//printf("%d\n", sizeof(arr2));//20
//	//printf("%d\n", sizeof(char [20]));//20
//	//printf("%d\n", sizeof(char));//1
//
//	//short s = 5;
//	//int b = 10;
//	//printf("%d\n", sizeof(s = b + 2));//2    sizeof括号中放的表达式是不参与运算的
//	//printf("%d\n", s);//5
//	//printf("%d\n", sizeof(short));//2
//
//	return 0;
//}


//int main()
//{
//	int a = -1;
//	//10000000000000000000000000000001  原码
//	//11111111111111111111111111111110  反码
//	//11111111111111111111111111111111  补码
//	
//	int b = ~a;
//	//11111111111111111111111111111111  
//	//00000000000000000000000000000000  ~按位取反
//	printf("%d\n", a);//-1
//	printf("%d\n", b);//0
//
//	return 0;
//}


//int main()
//{
//	int a = 13;
//	//把a的二进制中的第5位置成1
//	//00000000000000000000000000001101  a
//	//00000000000000000000000000010000  1<<4
//	//00000000000000000000000000011101  a | (1<<4)
//	a = a | (1 << 4);
//	printf("a=%d\n", a);//a=29
//
//	//把a的二进制中的第5位置成0
//	//00000000000000000000000000011101  a
//	//11111111111111111111111111101111	~(1<<4)
//	//00000000000000000000000000010000  1<<4
//	//00000000000000000000000000001101	a & ~(1<<4)
//	a = a & ~(1 << 4);
//	printf("a=%d\n", a);//a=13
//
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	//int b = a++;//后置++：先使用，后++
//	//int b = ++a;//前置++：先++，后使用
//	//int b = a--;//后置--：先使用，后--
//	//int b = --a;//前置--：先--，后使用
//
//	//printf("a=%d\n", a);
//	//printf("b=%d\n", b);
//
//	printf("%d\n", a--);
//	printf("%d\n", a);
//
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	printf("%p\n", &a);//& - 取地址操作符
//	int* pa = &a;//pa是用来存放地址的 - pa就是一个指针变量
//	*pa = 20;//* - 解引用操作符 - 间接访问操作符
//	printf("%d\n", a);
//
//	return 0;
//}


//int main()
//{
//	int a = (int)3.14;
//	printf("%d\n", a);//3
//
//	return 0;
//}


/*   --------------------     关系操作符: > >= < <= != ==    ---------------------   */

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//if (a > b)
//	//if (a >= b)
//	//if (a < b)
//	//if (a <= b)
//	//if (a != b)
//	//if (a == b)
//	{
//
//	}
//
//	return 0;
//}
//=赋值   ==比较相等
//比较两个字符串相等，不能使用==


/*   --------------------     逻辑操作符: &&  ||    ---------------------   */

//int main()
//{
//	int i = 0, a = 1, b = 2, c = 3, d = 4;
//	i = a++ && ++b && d++;
//	//i = a++ || ++b || d++;
//	printf("a=%d\nb=%d\nc=%d\nd=%d\n", a, b, c, d);
//
//	return 0;
//}


/*   --------------------     条件操作符(三目操作符): (exp1 ? exp2 : exp3)    ---------------------   */

//int main()
//{
//	int a = 3;
//	int b = 0;
//	/*if (a > 5)
//	{
//		b = 1;
//	}
//	else
//	{
//		b = -1;
//	}*/
//	//三目操作符
//	//b = (a > 5 ? 1 : -1);
//	//printf("%d\n", b);
//
//	int max = (a > b ? a : b);
//	printf("%d\n", max);
//
//	return 0;
//}


/*   --------------------     逗号表达式: (exp1 , exp2 , exp3 , ...)    ---------------------   */

//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = 0;
//	//逗号表达式 - 要从左向右依次计算，但是整个表达式的结果是最后一个表达式的结果
//
//	int d = (c = 1, a = c + 3, b = a - 2, c += b);
//	       //c=1    a=4        b=2        c=3
//	printf("%d\n", d);
//
//	return 0;
//}


//int main()
//{
//	int a = get_val();
//	count_val(a);
//	while (a > 0)
//	{
//		//业务处理
//		a = get_val();
//		count_val(a);
//	}
//
//	//使用逗号表达式改写
//	while (a = get_val, count_val(a), a > 0)
//	{
//		//业务处理
//	}
//
//	return 0;
//}


/*   --------------------    下标引用、函数调用、结构成员    ---------------------   */

//结构成员访问操作符： .  ->
//结构体（自定义类型）
//创建一个自定义的类型
//struct Book
//{
//	//结构体的成员变量
//	char name[20];
//	char id[20];
//	int price;
//};
//
//int main()
//{
//	struct Book b = { "C语言","C202208",54 };
//	struct Book* pb = &b;
//	//结构体变量名.成员名
//	/*printf("书名：%s\n", b.name);
//	printf("书号：%s\n", b.id);
//	printf("价格：%d\n", b.price);*/
//
//	//
//	/*printf("书名：%s\n", (*pb).name);
//	printf("书号：%s\n", (*pb).id);
//	printf("价格：%d\n", (*pb).price);*/
//
//	//结构体指针->成员名
//	printf("书名：%s\n", pb->name);
//	printf("书号：%s\n", pb->id);
//	printf("价格：%d\n", pb->price);
//
//	return 0;
//}


/*  ---------------------------   表达式求值  ------------------------------  */

//隐式类型转换：整型提升、算数转换

//整型提升

//int main()
//{
//	char a = 3;
//	//00000011  a
//	char b = 127;
//	//01111111  b
//	char c = a + b;//整型提升,补符号位
//	//00000000000000000000000000000011  a
//	//00000000000000000000000001111111  b
//	//00000000000000000000000010000010  a+b
//	//10000010  c
//	//11111111111111111111111110000010  补码
//	//11111111111111111111111110000001  反码
//	//10000000000000000000000001111110  原码
//	//-126
//
//	printf("%d\n", c);
//
//	return 0;
//}


//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(-c));//4
//	printf("%u\n", sizeof(!c));//4   VS编译器打印的是1，其实应该为4
//
//	return 0;
//}


//算数转换

//long double
//double
//float
//unsigned long int
//long int
//unsigned int
//int 


//符号的属性：优先级、结合性、是否控制求值顺序

